dangaow/damn/firmware/esp32-bridge-display/display_bridge.ino
/**
 * MochaTool Display —— 带状态屏的蓝牙 HID 桥接盒固件
 *
 * 硬件：任意 ESP32 DevKit（WROOM-32，¥20-40）+ 外接 SSD1306 0.96" I2C 4针 OLED（¥5-10）
 *       4 根母对母杜邦线免焊直插（下方"接线"）
 *
 * 屏幕（128x64）实时显示：
 *   ┌────────────────┐
 *   │ MochaTool        │
 *   │ WiFi  [OK] 已连 │
 *   │ 被控端[OK] 已连接│  ← 朋友 iPhone 蓝牙连上了盒子
 *   │ 控制端[--] 未连接│  ← 你在家还没通过服务器接入
 *   │ 房间 XIAOMING    │
 *   └────────────────┘
 *
 *  语义说明：
 *  「被控端」= 朋友的 iPhone（通过蓝牙 HID 与盒子配对）
 *  「控制端」= 你的安卓手机（通过服务器连入同一房间，状态由服务器 room_state 广播）
 *
 * 接线（免焊）：
 *   屏幕 VCC → 板子 3V3
 *   屏幕 GND → 板子 GND
 *   屏幕 SCL → 板子 D22 (GPIO22)
 *   屏幕 SDA → 板子 D21 (GPIO21)
 *   蜂鸣器(+/-) → GPIO33 / GND（有源注意正负极、反接不响不坏；无源两极可反接；模块版 VCC→3V3、GND→GND、信号→GPIO33）
 *   散热风扇 PWM → GPIO26（可用 MOS 模块调速，或接支持 PWM 的风扇）
 *
 * 外设（蜂鸣 / 风扇）接口：
 *   - 开机有低音量开机音效；连服务器/双方在线会"嘀"一声
 *   - 风扇 5 档调速：0%/20%/50%/70%/100%，操作页用格子状态显示
 *   - 运行中可被手机 App 实时下发 config 指令开关蜂鸣/风扇/换房间码，免重烧录
 *
 * 物理按键（板载 BOOT 键，GPIO0，免接线）：
 *   - 单击：循环切页  主页面 → 帮助 → 蜂鸣 → 风扇 → 重置 → 主页面
 *   - 双击：在【蜂鸣】页切换 开/关；在【风扇】页循环切换 5 档转速；
 *           在【重置】页启动 5s 倒计时
 *   - 重置倒计时期间：任意按键 = 取消；5s 走满后进入三击确认
 *   - 重置确认页：双击退出，三击执行恢复出厂并重启
 *   - 屏幕右上角常驻小爱心 ♡；切页有渐隐渐现过渡；操作页底部操作提示
 *
 * 开机逻辑：若已填过配置并连上服务器 → 首次连接弹出"配置成功！"烟花特效后进入主屏
 *
 * 烧录（Arduino IDE）：
 *   开发板：ESP32 Dev Module
 *     Tools → Partition Scheme: 选 "Huge APP (3MB No OTA/1MB SPIFFS)"
 *           （中文相关，避免编译报 region overflow）
 *     Tools → Flash Size: 4MB
 *   依赖库：
 *     1. "U8g2"（作者 Oliver Kraus）—— 屏幕驱动
 *     2. "NimBLE-Arduino"（作者 h2zero）
 *     3. "Callback"（作者 Tom Stewart）
 *     4. "WebSockets"（作者 Markus Sattler）
 *     5. "WiFiManager"（作者 tzapu）
 *     6. "ArduinoJson"（作者 Benoit Blanchon，v6）
 *     7. 主库 ZIP 安装：https://github.com/Mystfit/ESP32-BLE-CompositeHID
 *        （Code → Download ZIP → 项目 → 导入库 → 添加 .ZIP 库）
 *     ⚠ 卸载 ESP32-BLE-Keyboard / Mouse / Combo（若装过），否则重复定义报错
 *     ⚠ 屏幕显示乱码/漏字：确认用的是 U8g2 界面里的 "u8g2_font_wqy12_t_gb2312"
 *       完整 GB2312 字库（勿用 gb2312a，它缺全角标点）
 */

#include <U8g2lib.h>
#include <WiFiManager.h>
#include <WebSocketsClient.h>
#include <ArduinoJson.h>
#include <Preferences.h>
#include <nvs_flash.h>
#include <BleCompositeHID.h>
#include <KeyboardDevice.h>
#include <MouseDevice.h>

// ---- 配网页面字段由用户填写（无内置默认服务器/房间码）----
// 修改前两行注意：DEFAULT_SERVER / DEFAULT_ROOM 已移除，全部由配网页面输入并按次保存

// ---- 配网页面美化：居中卡片 + 房间"留空=沿用上次"提示 ----
// 通过 WiFiManager 的 setCustomHeadElement 注入 <style>/<script>，
// 不动它默认的保存逻辑（输入过的字段下次自动带值，留空则不覆盖上次保存）。
static const char settingsHead[] PROGMEM = R"html(<style>
  *{box-sizing:border-box}
  body{
    font-family:-apple-system,"PingFang SC","Microsoft YaHei",system-ui,sans-serif;
    background:linear-gradient(135deg,#667eea,#764ba2);
    margin:0;min-height:100vh;
    display:flex;align-items:center;justify-content:center;padding:20px;
  }
  .card{
    background:#fff;border-radius:18px;box-shadow:0 14px 44px rgba(0,0,0,.25);
    padding:28px 30px;width:100%;max-width:420px;text-align:center;
  }
  .logo{font-size:22px;font-weight:700;color:#5a3fd4;margin-bottom:2px}
  .sub{color:#8a8a9e;font-size:12px;margin:2px 0 18px}
  .card form{display:flex;flex-direction:column;gap:12px}
  .card label{font-size:13px;color:#2d2a3e;text-align:left;font-weight:700}
  .card input[type=text],.card input[type=password],.card select{
    width:100%;padding:12px 14px;font-size:15px;color:#2d2a3e;
    background:#f4f3fa;border:1px solid #e8e6f2;
    border-radius:12px;outline:none;transition:.2s;
  }
  .card input:focus,.card select:focus{border-color:#667eea;box-shadow:0 0 0 3px rgba(102,126,234,.18)}
  .hint{font-size:12px;color:#8a8a9e;text-align:left;margin-top:-4px}
  .card input[type=submit],.card input[type=button],.card button{
    width:100%;padding:13px;font-size:16px;font-weight:600;color:#fff;
    background:linear-gradient(135deg,#667eea,#764ba2);border:none;
    border-radius:14px;cursor:pointer;margin-top:6px;
  }
  .card input[type=submit]:active,.card button:active{
    background:linear-gradient(135deg,#5568d5,#6a4396);
  }
</style>
<script>
window.addEventListener('DOMContentLoaded',function(){
  function box(n){return document.querySelector('[name="'+n+'"]')}
  // 把 WiFiManager 默认表单包进居中卡片
  var f=document.querySelector('form');
  if(f && f.parentNode){
    var c=document.createElement('div'); c.className='card';
    var logo=document.createElement('div'); logo.className='logo'; logo.textContent='MochaTool';
    var sub=document.createElement('div'); sub.className='sub'; sub.textContent='请配置 WiFi 网络';
    f.parentNode.insertBefore(c, f); c.appendChild(logo); c.appendChild(sub); c.appendChild(f);
  }
  var room=box('room'), server=box('server');
  function addHint(input,text){
    var h=document.createElement('div'); h.className='hint';
    h.textContent=text; input.parentNode.insertBefore(h, input.nextSibling);
  }
  if(room){
    room.setAttribute('placeholder', '房间码  留空沿用上次');
    addHint(room, '留空沿用上次保存的房间码');
  }
  if(server && !(server.value||'').trim()){
    server.setAttribute('placeholder','ws://服务器IP:9000  留空沿用上次');
  }
});
</script>)html";

// ---- 指令协议（与安卓端约定）----
// {type:"hid", action:"move|drag|down|up|click|scroll", dx:int, dy:int}
// {type:"hid_text", value:"要打的字（英文/拼音，走真实键盘）"}

// ---- 屏幕（外接 SSD1306 OLED，HW I2C 默认 SDA=GPIO21 SCL=GPIO22）----
U8G2_SSD1306_128X64_NONAME_F_HW_I2C u8g2(U8G2_R0, U8X8_PIN_NONE);

BleCompositeHID compositeHID("MochaTool", "MochaTool", 100);
KeyboardDevice* keyboard = new KeyboardDevice();
MouseDevice* mouse = new MouseDevice();

WebSocketsClient ws;
Preferences prefs;
String serverUrl, room;

unsigned long lastPing = 0;
unsigned long lastDraw = 0;
bool wsConnected = false;
bool wifiOk = false;
bool controllerOnline = false;   // 控制端（安卓 viewer）是否在本房间在线，由服务器 room_state 通知

#ifndef LED_BUILTIN
#define LED_BUILTIN 2
#endif

// ---- 外设引脚（接线见文件头注释；部分 ROM 引脚可能不同，按需改这里） ----
#define PIN_BUZZER  33   // 蜂鸣器：GPIO33 → 蜂鸣器正极（负极接 GND）
#define PIN_FAN     26   // 散热风扇 PWM：GPIO26 → MOS/风扇 PWM 控制脚

// ---- 运行时配置（存 NVS，可在手机端/本地面板实时调整，免重烧录） ----
// ---- LEDC 通道：core 3.x 用 pin 寻址（ledcWrite 传 pin），core 2.x 用 channel ----
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  #define BUZZ_PWM_CH  PIN_BUZZER
  #define FAN_PWM_CH   PIN_FAN
#else
  #define BUZZ_PWM_CH  1   // LEDC 通道 1 → 蜂鸣
  #define FAN_PWM_CH   2   // LEDC 通道 2 → 风扇
#endif
#define PWM_BITS     8   // 8 位分辨率，占空比 0..255

// 动态改蜂鸣频率（无源蜂鸣器变调用）：core 3.x 用 ledcChangeFrequency，core 2.x 用 ledcSetup
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  #define BUZZ_SET_FREQ(f)  ledcChangeFrequency(PIN_BUZZER, (f), PWM_BITS)
#else
  #define BUZZ_SET_FREQ(f)  ledcSetup(BUZZ_PWM_CH, (f), PWM_BITS)
#endif
#define FAN_PWM_INVERTED 1 // 1=低电平触发模块（如 JY-25-003），输出占空比取反

// 风扇 5 档百分比：0/20/50/70/100；蜂鸣器固定音量、仅开关
const uint8_t PERI_LEVELS = 5;
const char* const PERI_PCT[PERI_LEVELS] = {"0%", "20%", "50%", "70%", "100%"};
const uint8_t fanSpeeds[PERI_LEVELS]  = {0, 51, 128, 178, 255}; // 风扇 duty
uint8_t fanLevel = 0;          // 风扇档位（默认 0 档 = 停）
bool fanOn = false;            // 风扇开关（0 档时视为关）
#define BUZZ_VOL  60           // 蜂鸣器固定音量 duty（0..255；太小有源蜂鸣器会不响）
bool buzzerOn = true;          // 蜂鸣器开关（音量固定，不可调）

// ---- 物理按键（板载 BOOT 键，GPIO0 = 电源键旁的 BOOT，按下接地，INPUT_PULLUP）----
#define PIN_BUTTON    0                // 免额外接线，直接用板子自带 BOOT 键
#define DBL_GAP_MS    280              // 两次松开在多少毫秒内算双击
#define DEBOUNCE_MS   20               // 按下抖动过滤

// 页面
enum Page { P_MAIN, P_HELP, P_BUZZ, P_FAN, P_RESET };
Page page = P_MAIN;

