dangaow/damn/firmware/esp32-bridge-display/display_bridge.ino
// 按键状态机（单击 / 双击）
bool btnDown = false;
unsigned long btnDownAt = 0;
unsigned long btnUpAt = 0;             // 松开时刻，用于识别双击
int clickCount = 0;                    // 当前窗口内点击次数
bool skipRelease = false;              // 重置倒计时取消后，吞掉本次松开的点击

// 重置流程
#define RST_HOLD_MS   5000             // 重置倒计时 5s
bool resetArmed = false;               // 正在 5s 走条（任意按键取消）
unsigned long resetArmedAt = 0;
bool resetConfirming = false;          // 走条完成，等待三击确认（双击退出）
int  resetConfirmCount = 0;            // 确认阶段累计点击数
unsigned long confirmDeadline = 0;     // 确认窗口超时

// 配置成功烟花
struct Part { float x, y, vx, vy; uint8_t life; };
Part parts[42];
bool configSplashShown = false;        // 是否已展示过烟花（仅首次连服务器展示）

// 被控端（iPhone 蓝牙）连接沿触发提示音
bool lastBleConnected = false;

// ---- HID 鼠标位移累积 + 节流（避免 BLE 报告队列积压导致卡顿/断连）----
int  pendingDx = 0, pendingDy = 0;   // 累积的鼠标位移（待合并发送）
int8_t pendingWheel = 0;             // 累积滚轮
bool dragHeld = false;               // 左键是否处于按下拖动状态
unsigned long lastHidFlush = 0;
#define HID_FLUSH_MS  15             // 每 15ms 合并刷新一次（≈66 报告/s，稳妥不积压）

// WiFi 断线自愈
unsigned long lastWifiRetry = 0;
int wifiFailCount = 0;

// ============================================================
// 初始化
// ============================================================

void setup() {
  Serial.begin(115200);
  pinMode(LED_BUILTIN, OUTPUT);
  pinMode(PIN_BUTTON, INPUT_PULLUP);          // 板载 BOOT 键（按下 = LOW）

  // ---- 状态屏启动 ----
  u8g2.begin();
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);   // 中文字体（含常用汉字）
  runBootAnimation();                        // 开启动画：MAKE STUDIO 渐显→停留→渐隐
  drawStatus("启动中…");

  // ---- 蓝牙 HID 键鼠启动（iPhone 配对后终身自动回连）----
  compositeHID.addDevice(keyboard);
  compositeHID.addDevice(mouse);
  compositeHID.begin();
  Serial.println("[BLE] MochaTool 已广播，等待 iPhone 配对…");

  // ---- 读取保存的配置 ----
  prefs.begin("rcbridge", false);
  serverUrl = prefs.getString("server", "");   // 无内置默认服务器，由用户填写
  room = prefs.getString("room", "");          // 无内置默认房间码，由用户填写

  // 外设配置：蜂鸣器（开关）/ 风扇（5 档）
  buzzerOn = prefs.getBool("buzz", true);
  fanLevel = constrain(prefs.getInt("fan", 0), 0, PERI_LEVELS - 1);
  fanOn = (fanLevel > 0) ? prefs.getBool("fanOn", true) : false;
  setupPeripherals();                          // 初始化 PWM 并应用到保存的配置
  bootTune();                                  // 四音符开机音效

  // ---- WiFi 配网 ----
  drawStatus("配网/连WiFi…");
  softBeep();
  WiFi.mode(WIFI_STA);
  WiFiManager wm;
  wm.setConfigPortalTimeout(180);

  // 配网热点用固定 IP（避开常见 192.168.x，防止被局域网路由器占用冲突）
  // 连上 "mochadangao" 后访问 http://10.10.10.1 打开配网页
  wm.setAPStaticIPConfig(
      IPAddress(10, 10, 10, 1),   // 热点自身 IP（也是网关）
      IPAddress(10, 10, 10, 1),
      IPAddress(255, 255, 255, 0));

  // 注入美化页面 + "留空沿用上次"提示（见文件顶部 settingsHead）
  wm.setCustomHeadElement(settingsHead);

  WiFiManagerParameter pServer("server", "服务器地址 ws://…", serverUrl.c_str(), 80);
  WiFiManagerParameter pRoom("room", "房间号", room.c_str(), 20);
  wm.addParameter(&pServer);
  wm.addParameter(&pRoom);

  if (!wm.autoConnect("mochadangao")) {
    Serial.println("[WiFi] 配网超时，重启…");
    drawStatus("配网超时,重启…");
    delay(2000);
    ESP.restart();
  }

  String newServer = pServer.getValue();
  String newRoom = pRoom.getValue();
  newServer.trim(); newRoom.trim(); newRoom.toUpperCase();
  if (newServer.length()) { serverUrl = newServer; prefs.putString("server", serverUrl); }   // 留空则沿用上次
  if (newRoom.length()) { room = newRoom; prefs.putString("room", room); }                    // 留空则沿用上次

  wifiOk = true;
  WiFi.setSleep(false);                  // 关闭 WiFi 省电（modem sleep），避免 WebSocket 心跳延迟导致断连
  softBeep();                            // 配置保存完成，小声提示
  Serial.printf("[WiFi] 已连接 %s\n", WiFi.SSID().c_str());
  Serial.printf("[CFG] server=%s room=%s\n", serverUrl.c_str(), room.c_str());

  // ---- 配置校验：未填服务器地址则不连服务器，提示重新配网 ----
  if (serverUrl.length() == 0 || room.length() == 0) {
    Serial.println("[CFG] 未配置服务器地址或房间码，等待重新配网…");
    drawStatus("未配置服务器/房间");
    return;
  }

  // ---- WebSocket 连中继服务器 ----
  drawStatus("连接服务器…");
  softBeep();
  connectWebSocket();
}

void connectWebSocket() {
  String url = serverUrl;
  url.replace("ws://", "");
  url.replace("wss://", "");
  bool secure = serverUrl.startsWith("wss://");
  int slash = url.indexOf('/');
  String hostPort = slash >= 0 ? url.substring(0, slash) : url;

  String host = hostPort;
  uint16_t port = secure ? 443 : 9000;   // 默认 9000（与服务器端口一致），避免漏填端口连不上
  int colon = hostPort.indexOf(':');
  if (colon >= 0) {
    host = hostPort.substring(0, colon);
    port = hostPort.substring(colon + 1).toInt();
  }

  ws.begin(host, port, "/");
  if (secure) ws.beginSSL(host.c_str(), port, "/");
  ws.onEvent(onWebSocketEvent);
  ws.setReconnectInterval(3000);
  // 协议层心跳：15s 一次 ping、5s 超时、连失 2 次判死线
  // 防止 WiFi 静默断链后 wsConnected 还挂在 true（屏幕显示"控制端已连接"骗人）
  ws.enableHeartbeat(15000, 5000, 2);
}

// ============================================================
// 外设：蜂鸣器
// ============================================================

/** 蜂鸣器短鸣一次（事件提示音，蜂鸣关闭时静音；音量固定 BUZZ_VOL） */
void buzzerBeep(int ms = 120, int duty = BUZZ_VOL) {
  if (!buzzerOn) return;
  (void)duty;   // 音量固定，忽略调用处的音量差异
  ledcWrite(BUZZ_PWM_CH, BUZZ_VOL);
  delay(ms);
  ledcWrite(BUZZ_PWM_CH, 0);
}

/** 状态切换小声提示音（音量固定） */
void softBeep() {
  if (!buzzerOn) return;
  ledcWrite(BUZZ_PWM_CH, BUZZ_VOL);
  delay(40);
  ledcWrite(BUZZ_PWM_CH, 0);
}

/** 播放指定频率音符（无源蜂鸣器变调，单位 Hz/ms），结束后恢复默认提示音频率 2500Hz */
void playTone(int freq, int ms, int duty = BUZZ_VOL) {
  if (!buzzerOn) return;
  (void)duty;   // 音量固定，忽略调用处的音量差异
  BUZZ_SET_FREQ(freq);
  ledcWrite(BUZZ_PWM_CH, BUZZ_VOL);
  delay(ms);
  ledcWrite(BUZZ_PWM_CH, 0);
  BUZZ_SET_FREQ(2500);   // 恢复事件提示音频率
}

/** 开机音效：do mi so do'（无源蜂鸣器变调） */
void bootTune() {
  // 音符频率：C4, E4, G4, C5
  const int tones[4] = {262, 330, 392, 523};
  const int toneMs = 170;
  const int gapMs  = 50;
  for (int i = 0; i < 4; i++) {
    if (buzzerOn) {
      BUZZ_SET_FREQ(tones[i]);
      ledcWrite(BUZZ_PWM_CH, BUZZ_VOL);
    }
    delay(toneMs);
    // 音符结束，蜂鸣停
    ledcWrite(BUZZ_PWM_CH, 0);
    if (i < 3) delay(gapMs);
  }
  // 恢复默认提示音频率
  BUZZ_SET_FREQ(2500);
}

/** 切页同步音效：蜂鸣 "bi" 一声 */
void pageBeepVib() {
  const int beepMs = 80;
  if (buzzerOn) {
    BUZZ_SET_FREQ(2000);
    ledcWrite(BUZZ_PWM_CH, BUZZ_VOL);
    delay(beepMs);
  }
  ledcWrite(BUZZ_PWM_CH, 0);
  BUZZ_SET_FREQ(2500);
}

/** 初始化所有外设 PWM 通道并应用到保存的配置 */
void setupPeripherals() {
  // 蜂鸣 2.5kHz / 风扇 25kHz
#if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL(3, 0, 0)
  ledcAttach(PIN_BUZZER, 2500, PWM_BITS);
  ledcAttach(PIN_FAN, 25000, PWM_BITS);
#else
  ledcSetup(BUZZ_PWM_CH, 2500, PWM_BITS);
  ledcAttachPin(PIN_BUZZER, BUZZ_PWM_CH);
  ledcSetup(FAN_PWM_CH, 25000, PWM_BITS);
  ledcAttachPin(PIN_FAN, FAN_PWM_CH);
#endif
  applyFan();
}

/** 应用风扇 PWM 输出 */
void applyFan() {
  uint8_t duty = (fanOn && fanLevel > 0) ? fanSpeeds[fanLevel] : 0;
#if FAN_PWM_INVERTED
  duty = 255 - duty; // 低电平触发模块：高电平=关，低电平=开
#endif
  ledcWrite(FAN_PWM_CH, duty);
  Serial.printf("[FAN] %s 档位=%d duty=%d\n", fanOn ? "开" : "关", fanLevel, duty);
}

/** 循环切换风扇档位：0→20→50→70→100→0 */
void cycleFanLevel() {
  fanLevel++;
  if (fanLevel >= PERI_LEVELS) fanLevel = 0;
  fanOn = (fanLevel > 0);
  prefs.putInt("fan", fanLevel);
  prefs.putBool("fanOn", fanOn);
  applyFan();
  buzzerBeep(60, 70);
  Serial.printf("[BTN] 风扇 -> %s\n", PERI_PCT[fanLevel]);
}

