dangaow/damn/firmware/esp32-bridge-display/display_bridge.ino
// ============================================================
// 外设开关 + 触摸切换（长按 切开关 / 短按 切页）
// ============================================================

/** 切换蜂鸣器 开/关（音量固定，不可调） */
void toggleBuzz() {
  buzzerOn = !buzzerOn;
  prefs.putBool("buzz", buzzerOn);
  if (!buzzerOn) ledcWrite(BUZZ_PWM_CH, 0);
  else buzzerBeep(120, 90);   // 打开时回一个提示音确认
  Serial.printf("[BTN] 蜂鸣 %s\n", buzzerOn ? "开" : "关");
}

/** 切换到下一页（主页面 → 帮助 → 蜂鸣 → 风扇 → 重置 → 主页面） */
void nextPage() {
  pageBeepVib();                         // 切页瞬间 "bi" 一声
  for (int c = 255; c > 0; c -= 20) { u8g2.setContrast(c); delay(4); }   // 渐隐
  switch (page) {
    case P_MAIN:  page = P_HELP; break;
    case P_HELP:  page = P_BUZZ; break;
    case P_BUZZ:  page = P_FAN;  break;
    case P_FAN:   page = P_RESET;break;
    default:      page = P_MAIN; break;
  }
  refreshScreen();                     // 立刻画新页
  for (int c = 0; c <= 255; c += 20) { u8g2.setContrast(c); delay(4); } // 渐现
  u8g2.setContrast(255);
}

/** 启动重置倒计时（重置页双击进入） */
void startResetArmed() {
  resetArmed = true;
  resetArmedAt = millis();
  resetConfirming = false;
  resetConfirmCount = 0;
  buzzerBeep(80, 100);
  Serial.println("[RST] 进入 5s 重置倒计时");
}

/** 取消重置倒计时 */
void cancelResetArmed() {
  resetArmed = false;
  resetConfirming = false;
  resetConfirmCount = 0;
  buzzerBeep(60, 60);
  Serial.println("[RST] 倒计时取消");
  refreshScreen();
}

/** 重置倒计时走满 → 进入三击确认 */
void enterResetConfirm() {
  resetArmed = false;
  resetConfirming = true;
  resetConfirmCount = 0;
  confirmDeadline = millis() + 10000;
  buzzerBeep(200, 120);
  Serial.println("[RST] 进入三击确认");
  refreshScreen();
}

/** 重置盒子：清空全部 NVS（含 WiFi 凭据）→ 重启自动重开配网热点 */
void resetBox() {
  // 重置时强制提示音（不受蜂鸣开关限制）
  ledcWrite(BUZZ_PWM_CH, BUZZ_VOL); delay(150); ledcWrite(BUZZ_PWM_CH, 0);

  drawStatus("正在清除配置…");
  delay(400);
  prefs.end();
  nvs_flash_erase();     // 擦除 NVS（含服务器/房间/已存 WiFi）
  nvs_flash_init();

  drawStatus("重启中…");
  delay(500);
  ESP.restart();
}

/**
 * 按键扫描：
 *   单击 = 切下一页；双击 = 切换当前页开关/档位（蜂鸣页切开关；风扇页切档；重置页进入 5s 倒计时）
 *   重置倒计时期间任意按键 = 取消；倒计时满 5s 后进入确认页
 *   确认页：双击 = 退出确认；三击 = 执行重置
 */
void handleButton() {
  unsigned long now = millis();
  bool pressed = (digitalRead(PIN_BUTTON) == LOW);   // GPIO0 按下接地

  // 重置倒计时期间：任意按键按下即取消，并吞掉本次按键（不触发切页/双击）
  if (resetArmed && pressed && !btnDown) {
    cancelResetArmed();
    btnDown = true;
    skipRelease = true;
  }

  if (pressed) {
    if (!btnDown) {                       // 按下沿
      btnDown = true; btnDownAt = now;
    }
  } else {
    if (btnDown) {                        // 松开沿
      btnDown = false;
      if (skipRelease) { skipRelease = false; return; }   // 吞掉取消用的松开
      if (now - btnDownAt < DEBOUNCE_MS) return;   // 抖动忽略
      btnUpAt = now;
      clickCount++;
    }
  }

  // 双击窗口结束后再判定动作
  if (clickCount > 0 && !btnDown && now - btnUpAt > DBL_GAP_MS) {
    int clicks = clickCount;
    clickCount = 0;

    if (resetConfirming) {
      // 确认页：双击退出，三击执行重置
      if (clicks == 2) {
        resetConfirming = false;
        resetConfirmCount = 0;
        buzzerBeep(60, 60);
        refreshScreen();
      } else if (clicks >= 3) {
        resetBox();
      } else {
        // 单击：记录为确认计数
        resetConfirmCount++;
        buzzerBeep(60, 80);
        confirmDeadline = now + 10000;
        refreshScreen();
        if (resetConfirmCount >= 3) resetBox();
      }
      return;
    }

    if (clicks == 2) {
      // 双击：切换当前页开关/档位 / 重置页进入倒计时
      if (page == P_BUZZ) { toggleBuzz(); refreshScreen(); }
      else if (page == P_FAN) { cycleFanLevel(); refreshScreen(); }
      else if (page == P_RESET) { startResetArmed(); }
    } else {
      // 单击：切页
      nextPage();
    }
  }

  // 重置倒计时走满
  if (resetArmed && now - resetArmedAt >= RST_HOLD_MS) {
    enterResetConfirm();
  }

  // 确认窗口超时 → 放弃
  if (resetConfirming && now > confirmDeadline) {
    resetConfirming = false;
    resetConfirmCount = 0;
    page = P_MAIN;
    buzzerBeep(60, 60);
    refreshScreen();
  }
}

/** 右上角常驻小爱心 ♡（图形绘制，避免字体缺字；color 决定深浅以适配背景） */
void drawHeart(int color = 1) {
  u8g2.setDrawColor(color);
  u8g2.drawDisc(112, 5, 4, U8G2_DRAW_ALL);   // 左鼓包
  u8g2.drawDisc(119, 5, 4, U8G2_DRAW_ALL);   // 右鼓包（与左重叠，形成连续上缘）
  u8g2.drawTriangle(108, 5, 123, 5, 116, 14); // 下尖（收窄，衔接两个鼓包）
  u8g2.setDrawColor(1);
}

// ============================================================
// 图标绘制（12x12 像素级极简图标）
// ============================================================

/** 画一个 12x12 图标在 (x,y)，y 为顶部；color=1 白，0 黑 */
void drawIconHelp(int x, int y, int color) {
  u8g2.setDrawColor(color);
  u8g2.drawCircle(x + 6, y + 6, 5, 1);
  u8g2.setDrawColor(1);
}
void drawIconBuzz(int x, int y, int color) {
  u8g2.setDrawColor(color);
  u8g2.drawTriangle(x + 2, y + 9, x + 5, y + 1, x + 5, y + 7);
  u8g2.drawLine(x + 7, y + 2, x + 9, y);
  u8g2.drawLine(x + 7, y + 5, x + 10, y + 4);
  u8g2.drawLine(x + 7, y + 8, x + 9, y + 10);
  u8g2.setDrawColor(1);
}
void drawIconFan(int x, int y, int color) {
  u8g2.setDrawColor(color);
  u8g2.drawCircle(x + 6, y + 6, 5, 1);
  for (int i = 0; i < 4; i++)
    u8g2.drawLine(x + 6, y + 6, x + 6 + (int)(5 * cos(i * 1.57f)), y + 6 - (int)(5 * sin(i * 1.57f)));
  u8g2.setDrawColor(1);
}
void drawIconReset(int x, int y, int color) {
  u8g2.setDrawColor(color);
  u8g2.drawCircle(x + 6, y + 7, 4, 1);
  u8g2.drawLine(x + 9, y + 2, x + 10, y);
  u8g2.drawLine(x + 10, y, x + 6, y);
  u8g2.drawLine(x + 6, y, x + 6, y + 4);
  u8g2.setDrawColor(1);
}

// ============================================================
// 操作页：统一设计语言（图标 + 大状态条 + 白底划过动画）
// ============================================================

/** 底部操作提示条：在所有操作页面底部常驻 */
void drawFooterHint(const char* hint) {
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);
  u8g2.drawHLine(0, 51, 128);
  int w = u8g2.getUTF8Width(hint);
  int x = (128 - w) / 2;
  if (x < 0) x = 0;
  u8g2.drawUTF8(x, 62, hint);
}

/** 画横向选项条静态帧：selected 项白底黑字，其余黑底白字 */
void drawSegmentBarFrame(int selected, const char* const labels[], int count, const char* title, int iconType) {
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);

  // 标题栏
  u8g2.setDrawColor(1);
  u8g2.drawBox(0, 0, 128, 15);
  u8g2.setDrawColor(0);
  switch (iconType) {
    case 1: drawIconBuzz(2, 2, 0); break;
    case 2: drawIconFan(2, 2, 0); break;
    case 3: drawIconReset(2, 2, 0); break;
    case 4: drawIconHelp(2, 2, 0); break;
  }
  u8g2.drawUTF8(16, 12, title);
  u8g2.setDrawColor(1);

