dangaow/damn/firmware/esp32-bridge-display/display_bridge.ino
  int barX = 4, barY = 24, barW = 120, barH = 22;
  int segW = barW / count;
  int fillX = barX + selected * segW;

  // 外框与分隔线
  u8g2.drawFrame(barX, barY, barW, barH);
  for (int i = 1; i < count; i++)
    u8g2.drawVLine(barX + i * segW, barY + 1, barH - 2);

  // 白色高亮块
  u8g2.setDrawColor(1);
  u8g2.drawBox(fillX + 1, barY + 1, segW - 2, barH - 2);

  // 文字：当前项黑字，其余白字
  for (int i = 0; i < count; i++) {
    int tx = barX + i * segW + (segW - u8g2.getUTF8Width(labels[i])) / 2;
    int ty = barY + 15;
    u8g2.setDrawColor(i == selected ? 0 : 1);
    u8g2.drawUTF8(tx, ty, labels[i]);
  }
  u8g2.setDrawColor(1);
  drawHeart(0);   // 右上角黑色爱心（标题栏白底上）
}

/** 带白底划过动画的选项条；from=-1 表示无动画 */
void drawSegmentBar(int selected, int from, const char* const labels[], int count, const char* title, int iconType) {
  int barX = 4, barY = 24, barW = 120, barH = 22;
  int segW = barW / count;
  int targetX = barX + selected * segW;
  int startX = (from >= 0) ? (barX + from * segW) : targetX;

  if (from != selected && from >= 0) {
    int steps = 6;
    for (int s = 0; s <= steps; s++) {
      int fillX = startX + (targetX - startX) * s / steps;
      u8g2.clearBuffer();
      // 画静态背景（标题 + 框线 + 分隔线）
      drawSegmentBarFrame(selected, labels, count, title, iconType);
      // 擦除高亮区并重画滑块到中间位置
      u8g2.setDrawColor(0);
      u8g2.drawBox(barX + 1, barY + 1, barW - 2, barH - 2);
      u8g2.setDrawColor(1);
      u8g2.drawBox(fillX + 1, barY + 1, segW - 2, barH - 2);
      // 文字：滑块覆盖的项黑字，其余白字
      for (int i = 0; i < count; i++) {
        int cellCenter = barX + i * segW + segW / 2;
        bool under = (cellCenter >= fillX && cellCenter < fillX + segW);
        int tx = barX + i * segW + (segW - u8g2.getUTF8Width(labels[i])) / 2;
        int ty = barY + 15;
        u8g2.setDrawColor(under ? 0 : 1);
        u8g2.drawUTF8(tx, ty, labels[i]);
      }
      u8g2.setDrawColor(1);
      u8g2.sendBuffer();
      delay(10);
    }
  }

  // 最终帧
  u8g2.clearBuffer();
  drawSegmentBarFrame(selected, labels, count, title, iconType);
}

/** 开关页（蜂鸣器）：开/关 两档 */
void drawSwitchPage(const char* title, bool isOn, int iconType, int& lastSel) {
  int sel = isOn ? 1 : 0;
  const char* labels[2] = {"关", "开"};
  drawSegmentBar(sel, lastSel, labels, 2, title, iconType);
  lastSel = sel;
  drawFooterHint("单击切页 · 双击切开关");
  u8g2.sendBuffer();
}

/** 档位页（风扇）：5 档百分比，双击循环切档 */
void drawLevelPage(const char* title, int iconType, int level, int& lastSel) {
  drawSegmentBar(level, lastSel, PERI_PCT, PERI_LEVELS, title, iconType);
  lastSel = level;
  drawFooterHint("单击切页 · 双击切档位");
  u8g2.sendBuffer();
}

/** 帮助页 */
void drawHelpPage() {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);

  // 标题栏白底黑字
  u8g2.drawBox(0, 0, 128, 15);
  u8g2.setDrawColor(0);
  drawIconHelp(2, 2, 0);
  u8g2.drawUTF8(16, 12, "帮助");
  u8g2.setDrawColor(1);
  drawHeart(0);   // 右上角黑色爱心（标题栏白底上）

  u8g2.drawUTF8(4, 26, "单击按钮：切换页面");
  u8g2.drawUTF8(4, 38, "双击按钮：切开关/调档");
  u8g2.drawUTF8(4, 50, "重置页：双击启动倒计时");

  drawFooterHint("单击切页");
  u8g2.sendBuffer();
}

/** 重置页：三态（待机 / 5s 倒计时 / 三击确认） */
void drawResetPage() {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);

  // 标题栏白底黑字
  u8g2.drawBox(0, 0, 128, 15);
  u8g2.setDrawColor(0);
  drawIconReset(2, 2, 0);
  u8g2.drawUTF8(16, 12, "重置配置");
  u8g2.setDrawColor(1);
  drawHeart(0);   // 右上角黑色爱心（标题栏白底上）

  if (resetConfirming) {
    u8g2.drawUTF8(4, 28, "确认要恢复出厂？");
    char buf[24];
    snprintf(buf, sizeof(buf), "已按 %d/3", resetConfirmCount);
    u8g2.drawUTF8(4, 42, buf);
    drawFooterHint("双击退出 · 三击重置");
  } else if (resetArmed) {
    int pct = (int)((long)(millis() - resetArmedAt) * 100 / RST_HOLD_MS);
    if (pct > 100) pct = 100;
    u8g2.drawUTF8(4, 26, "警告：此操作不可逆！");
    u8g2.drawFrame(14, 34, 100, 9);                       // 进度条外框
    u8g2.setDrawColor(0);
    u8g2.drawBox(17, 37, 94 * pct / 100, 3);              // 填充
    u8g2.setDrawColor(1);
    drawFooterHint("按任意键取消");
  } else {
    u8g2.drawUTF8(4, 28, "双击开始重置倒计时");
    u8g2.drawUTF8(4, 42, "将清空配置重开热点");
    drawFooterHint("单击切页 · 双击开始");
  }
  u8g2.sendBuffer();
}

/** 按当前页重绘屏幕（主循环周期调用；每页自带 latest 帧） */
void refreshScreen() {
  static int lastBuzzSel = -1, lastFanSel = -1;
  switch (page) {
    case P_MAIN:  drawMainStatus(); break;
    case P_HELP:  drawHelpPage(); break;
    case P_BUZZ:  drawSwitchPage("蜂鸣开关", buzzerOn, 1, lastBuzzSel); break;
    case P_FAN:   drawLevelPage("风扇转速", 2, fanLevel, lastFanSel); break;
    case P_RESET: drawResetPage(); break;
  }
}

// ---- 配置成功烟花：粒子从屏幕上部爆开 + 背景文字 ----
void initFireworks() {
  randomSeed(esp_random());
  for (int i = 0; i < 42; i++) {
    float a = (random(360) * 3.14159f) / 180.0f;
    float sp = random(28, 90) / 10.0f;
    parts[i].x = 64; parts[i].y = 18;
    parts[i].vx = cos(a) * sp; parts[i].vy = -sin(a) * sp;
    parts[i].life = 255;
  }
}

void updateFireworks() {
  static unsigned long last = 0;
  unsigned long now = millis();
  if (now - last < 35) return;
  int dt = (int)(now - last); last = now;
  (void)dt;
  for (int i = 0; i < 42; i++) {
    parts[i].vy += 0.35f;                 // 重力
    parts[i].x += parts[i].vx;
    parts[i].y += parts[i].vy;
    parts[i].vx *= 0.90f; parts[i].vy *= 0.90f;   // 阻尼
    if (parts[i].life > 8) parts[i].life -= 8;
  }
}

void drawFireworksFrame() {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);
  u8g2.setDrawColor(1);
  for (int i = 0; i < 42; i++) {
    int x = (int)parts[i].x, y = (int)parts[i].y;
    if (x >= 0 && x < 128 && y >= 0 && y < 64 && parts[i].life > 120) {
      u8g2.drawPixel(x, y);
    }
  }
  drawUTF8Center("配置成功！", 40);      // 文字叠在烟花之上
  u8g2.sendBuffer();
}

/** 首次连上服务器：烟花庆祝 3s + 提示音，然后进主屏 */
void runConfigSuccess() {
  if (configSplashShown) return;
  configSplashShown = true;
  initFireworks();
  unsigned long end = millis() + 3000;
  while (millis() < end) {
    updateFireworks();
    drawFireworksFrame();
    delay(35);
  }
  buzzerBeep(180, 100);
  u8g2.setContrast(255);
  refreshScreen();
}

