dangaow/damn/firmware/esp32-bridge-display/display_bridge.ino
// ============================================================
// WebSocket 事件
// ============================================================

void onWebSocketEvent(WStype_t type, uint8_t* payload, size_t len) {
  switch (type) {
    case WStype_CONNECTED: {
      StaticJsonDocument<128> reg;
      reg["type"] = "register";
      reg["role"] = "bridge";
      reg["room"] = room;
      String out; serializeJson(reg, out);
      ws.sendTXT(out);
      wsConnected = true;
      Serial.println("[WS] 已连入房间 " + room);
      // 首次连上服务器 → 烟花"配置成功！"；之后的重连只做普通提示
      if (!configSplashShown) runConfigSuccess();
      else { buzzerBeep(120); }
      break;
    }
    case WStype_DISCONNECTED:
      wsConnected = false;
      controllerOnline = false;   // 服务器断开：无法得知控制端在线与否，视为未在线
      break;
    case WStype_TEXT:
      handleCommand((const char*)payload, len);
      break;
    default:
      break;
  }
}

/** 把累积的鼠标位移/滚轮合并成一次 HID 报告发送（loop 里定时调用，避免逐条发导致 BLE 积压） */
void flushHid() {
  if (pendingWheel != 0) {
    mouse->mouseMove(0, 0, 0, pendingWheel);   // dx/dy=0，wheel=pendingWheel
    pendingWheel = 0;
  }
  if (pendingDx != 0 || pendingDy != 0) {
    int sx = constrain(pendingDx, -127, 127);
    int sy = constrain(pendingDy, -127, 127);
    mouse->mouseMove((signed char)sx, (signed char)sy);
    pendingDx -= sx;   // 超出 ±127 的余量留给下一帧，不丢位移
    pendingDy -= sy;
  }
}

void handleCommand(const char* json, size_t len) {
  DynamicJsonDocument doc(1024);   // 打字文本较长，静态 384 会解析失败，改用 1KB 动态缓冲
  if (deserializeJson(doc, json, len)) return;

  const char* type = doc["type"] | "";
  // 服务器广播：本房间控制端在线数（控制端加入/离开时推送）
  if (strcmp(type, "room_state") == 0) {
    int viewers = doc["viewers"] | 0;
    bool wasOnline = controllerOnline;
    controllerOnline = viewers > 0;
    // 控制端新上线（本房间有人接入）→ 提示音（"双方在线"庆祝一次）
    if (controllerOnline && !wasOnline) {
      buzzerBeep(120, 90);
    }
    Serial.printf("[WS] 控制端在线数=%d\n", viewers);
    return;
  }
  // 运行时配置指令：{type:"config", buzz:bool, fan:int, beep:bool, room:"..."}
  if (strcmp(type, "config") == 0) {
    if (doc["buzz"].is<bool>()) {
      buzzerOn = doc["buzz"];
      prefs.putBool("buzz", buzzerOn);
      if (!buzzerOn) ledcWrite(BUZZ_PWM_CH, 0);
    }
    if (doc["fan"].is<int>()) {
      int fanIdx = doc["fan"];
      fanLevel = constrain(fanIdx, 0, PERI_LEVELS - 1);
      fanOn = (fanLevel > 0);
      prefs.putInt("fan", fanLevel);
      prefs.putBool("fanOn", fanOn);
      applyFan();
    }
    // 主动请求一次提示音（App 里"测试蜂鸣"）
    if (doc["beep"].is<bool>() && doc["beep"]) {
      buzzerBeep(150);
    }
    // 换房间码：写 NVS 后重连服务器
    if (doc["room"].is<const char*>()) {
      String newRoom = (const char*)doc["room"];
      newRoom.trim(); newRoom.toUpperCase();
      if (newRoom.length()) {
        room = newRoom;
        prefs.putString("room", room);
        Serial.println("[CFG] 房间码 <- " + room);
        ws.disconnect();          // 触发重连 + 重新 register 进新房间
      }
    }
    return;
  }
  if (strcmp(type, "hid") == 0) {
    if (!compositeHID.isConnected()) return;  // iPhone 未连蓝牙，丢弃
    String action = doc["action"] | "";
    int dx = doc["dx"] | 0;
    int dy = doc["dy"] | 0;

    if (action == "move") {
      pendingDx += dx; pendingDy += dy;        // 累积，等 loop 定时合并发送
    } else if (action == "drag") {
      if (!dragHeld) { mouse->mousePress(); dragHeld = true; }  // 按下只在首次触发，不重复 press
      pendingDx += dx; pendingDy += dy;
    } else if (action == "down") {
      flushHid();                              // 先把积压的位移发掉，再按下
      mouse->mousePress();
      dragHeld = true;
    } else if (action == "up") {
      flushHid();                              // 松手前把剩余位移发完
      mouse->mouseRelease();
      dragHeld = false;
    } else if (action == "click") {
      flushHid();
      // 库的 mouseClick() 是空实现（No-op），这里手动按下+松开模拟一次点击
      mouse->mousePress();
      delay(60);                               // 按下保持 60ms，确保 iOS 能识别为一次点击
      mouse->mouseRelease();
    } else if (action == "scroll") {
      pendingWheel = (int8_t)constrain((int)pendingWheel + dx, -127, 127);  // 累积滚轮
    }
  }
  else if (strcmp(type, "hid_text") == 0) {
    if (!compositeHID.isConnected()) return;
    const char* value = doc["value"] | "";
    typeString(value);
  }
}

/** ASCII 字符 → HID 键码 + 是否需要 Shift（返回 0 = 不支持该字符） */
uint8_t asciiToHid(unsigned char c, bool &needShift) {
  needShift = false;
  if (c >= 'a' && c <= 'z') return 0x04 + (c - 'a');
  if (c >= 'A' && c <= 'Z') { needShift = true; return 0x04 + (c - 'A'); }
  if (c >= '1' && c <= '9') return 0x1E + (c - '1');
  switch (c) {
    case '0': return 0x27;  case ')': { needShift = true; return 0x27; }
    case '!': { needShift = true; return 0x1E; }
    case '@': { needShift = true; return 0x1F; }
    case '#': { needShift = true; return 0x20; }
    case '$': { needShift = true; return 0x21; }
    case '%': { needShift = true; return 0x22; }
    case '^': { needShift = true; return 0x23; }
    case '&': { needShift = true; return 0x24; }
    case '*': { needShift = true; return 0x25; }
    case '(': { needShift = true; return 0x26; }
    case '\n': return 0x28;                       // 回车
    case ' ': return 0x2C;
    case '-': return 0x2D;  case '_': { needShift = true; return 0x2D; }
    case '=': return 0x2E;  case '+': { needShift = true; return 0x2E; }
    case '[': return 0x2F;  case '{': { needShift = true; return 0x2F; }
    case ']': return 0x30;  case '}': { needShift = true; return 0x30; }
    case '\\': return 0x31; case '|': { needShift = true; return 0x31; }
    case ';': return 0x33;  case ':': { needShift = true; return 0x33; }
    case '\'': return 0x34; case '"': { needShift = true; return 0x34; }
    case '`': return 0x35;  case '~': { needShift = true; return 0x35; }
    case ',': return 0x36;  case '<': { needShift = true; return 0x36; }
    case '.': return 0x37;  case '>': { needShift = true; return 0x37; }
    case '/': return 0x38;  case '?': { needShift = true; return 0x38; }
    case '\t': return 0x2B;
    default:   return 0;
  }
}

/** 远程打字：逐字符转 HID 键码发送（中文需对方用拼音输入法逐字选词） */
void typeString(const char* s) {
  for (size_t i = 0; s[i] != '\0'; i++) {
    unsigned char c = (unsigned char)s[i];
    bool shift = false;
    uint8_t key = asciiToHid(c, shift);
    if (key == 0) continue;
    if (shift) keyboard->modifierKeyPress(KEY_MOD_LSHIFT);
    keyboard->keyPress(key);
    delay(8);
    keyboard->keyRelease(key);
    if (shift) keyboard->modifierKeyRelease(KEY_MOD_LSHIFT);
    delay(8);
  }
}

