dangaow/damn/firmware/esp32-bridge-display/display_bridge.ino
// ============================================================
// 状态屏
// ============================================================

/**
 * 开机动画：插电 → 停 1s → MAKE STUDIO 渐显（居中）→ 停留 3s（期间初始化）→ 渐隐
 */
void runBootAnimation() {
  const char* logo = "MAKE STUDIO";
  const char* sub = "莫莫专属助手";

  u8g2.setFont(u8g2_font_wqy12_t_gb2312);
  u8g2.setMaxClipWindow();
  u8g2.clearBuffer();
  u8g2.sendBuffer();
  delay(800);

  // 计算 LOGO 与副标题的左右边界，用于逐列扫描
  int lw = u8g2.getUTF8Width(logo);
  int lx = (128 - lw) / 2; if (lx < 0) lx = 0;
  int sw = u8g2.getUTF8Width(sub);
  int sx = (128 - sw) / 2; if (sx < 0) sx = 0;
  int left  = (lx < sx) ? lx : sx;
  int right = (lx + lw > sx + sw) ? (lx + lw) : (sx + sw);
  if (right > 128) right = 128;

  // 渐显：逐列从左到右揭示（真正"从无到有"，不依赖对比度）
  for (int x = left; x <= right; x += 3) {
    u8g2.clearBuffer();
    u8g2.setDrawColor(1);
    u8g2.setClipWindow(0, 0, x, 63);
    drawUTF8Center(logo, 40);
    drawUTF8Center(sub, 54);
    u8g2.sendBuffer();
    u8g2.setMaxClipWindow();
    delay(10);
  }

  delay(3000);   // 停留 3 秒，后台初始化

  // 渐隐：从右向左逐列擦黑
  for (int x = 128; x >= 0; x -= 4) {
    u8g2.clearBuffer();
    u8g2.setClipWindow(x, 0, 128, 63);
    u8g2.sendBuffer();
    u8g2.setMaxClipWindow();
    delay(6);
  }

  u8g2.clear();
  u8g2.sendBuffer();
}

/** 在水平方向居中的位置画一行 UTF-8（y 为基线） */
void drawUTF8Center(const char* s, int y) {
  int w = u8g2.getUTF8Width(s);
  int x = (128 - w) / 2;
  if (x < 0) x = 0;
  u8g2.drawUTF8(x, y, s);
}

/** 启动阶段的单行提示（统一 12px，节省 flash 不加载 16px 字库） */
void drawStatus(const char* msg) {
  u8g2.clearBuffer();
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);
  u8g2.drawStr(4, 16, "MochaTool");
  u8g2.drawUTF8(4, 44, msg);
  u8g2.sendBuffer();
}

/** 主状态屏：WiFi / 被控端 / 控制端 / 房间 实时状态 */
void drawMainStatus() {
  u8g2.clearBuffer();

  // 标题栏
  u8g2.setFont(u8g2_font_wqy12_t_gb2312);
  u8g2.drawBox(0, 0, 128, 15);
  u8g2.setDrawColor(0);
  u8g2.drawUTF8(2, 12, "MochaTool");
  u8g2.setDrawColor(1);
  drawHeart(0);           // 白标题栏上用黑色小爱心（常驻右上角）

  // WiFi 行（实时查询，掉线立刻变空心，不缓存启动时的结果）
  bool wifiLive = (WiFi.status() == WL_CONNECTED);
  drawStateLine(1, "WiFi", wifiLive);

  // 被控端行：朋友的 iPhone 是否连上盒子的蓝牙（HID 库实时状态）
  bool bleOk = compositeHID.isConnected();
  drawStateLine(2, "被控端", bleOk);

  // 控制端行：服务器 room_state 实时通知（viewer 加入/离开 1 秒内推送）
  bool ctrlOk = wifiLive && wsConnected && controllerOnline;
  drawStateLine(3, "控制端", ctrlOk);

  // 底部：只显示房间名称（居中）
  u8g2.drawHLine(0, 50, 128);
  String roomLine = "房间 " + room;
  int rw = u8g2.getUTF8Width(roomLine.c_str());
  u8g2.drawUTF8((128 - rw) / 2, 59, roomLine.c_str());

  u8g2.sendBuffer();
}

/** 画一行状态：标签 + 右侧圆点（实心=已连接，空心=未连接） */
void drawStateLine(int row, const char* label, bool ok) {
  int y = 18 + row * 11;               // 行基线
  u8g2.drawUTF8(2, y, label);
  int cx = 120, cy = y - 6;            // 状态圆点中心（上移避免碰底部分割线）
  if (ok) u8g2.drawDisc(cx, cy, 4, U8G2_DRAW_ALL);     // 实心=已连接
  else    u8g2.drawCircle(cx, cy, 4, U8G2_DRAW_ALL);   // 空心=未连接
}

// ============================================================
// 主循环
// ============================================================

void loop() {
  ws.loop();

  unsigned long now = millis();

  // WiFi 断线检测与自愈：掉线后异步重连，多次失败则重启（长年待命设备最可靠）
  if (wifiOk && WiFi.status() != WL_CONNECTED) {
    if (now - lastWifiRetry > 10000) {
      lastWifiRetry = now;
      wifiFailCount++;
      Serial.printf("[WiFi] 掉线，第 %d 次重连…\n", wifiFailCount);
      WiFi.disconnect();
      WiFi.reconnect();            // 异步触发重连，不阻塞 loop
      if (wifiFailCount >= 5) {    // 约 50s 仍未恢复 → 重启
        Serial.println("[WiFi] 重连多次失败，重启…");
        delay(200);
        ESP.restart();
      }
    }
  } else if (WiFi.status() == WL_CONNECTED) {
    wifiFailCount = 0;
  }

  // 物理按键：短按切页 / 长按切开关 / 重置流程
  handleButton();

  // HID 鼠标位移合并发送（每 15ms 一次，避免逐条发导致 BLE 队列积压）
  if (now - lastHidFlush >= HID_FLUSH_MS) {
    lastHidFlush = now;
    flushHid();
  }

  // 心跳保活
  if (wsConnected && now - lastPing > 20000) {
    lastPing = now;
    ws.sendTXT("{\"type\":\"ping\"}");
  }

  // 被控端（iPhone 蓝牙）连上沿 → 提示音（代表"双方接通"）
  bool bleNow = compositeHID.isConnected();
  if (bleNow && !lastBleConnected) { buzzerBeep(120, 90); }
  lastBleConnected = bleNow;

  // 屏幕刷新：正常 500ms；重置倒计时/确认阶段需更跟手，100ms
  unsigned long refreshMs = (page == P_RESET && (resetArmed || resetConfirming)) ? 100 : 500;
  if (now - lastDraw > refreshMs) {
    lastDraw = now;
    refreshScreen();
  }

  // LED 辅助指示：常亮 = 一切就绪；快闪 = iPhone 未连
  digitalWrite(LED_BUILTIN, compositeHID.isConnected() ? HIGH : ((now / 300) % 2));
}
